       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      **************************************
      * AREA DE COMENTÁRIOS - REMARKS
      * PROGRAMA CRIADO SEGUINDO O CURSO DA ALURA
      * "COBOL: PRIMEIROS PASSOS"
      * AUTOR: JULIO BITTENCOURT - JULIOB
      * DATA: 24/10/2021
      * OBJETIVO: DISPLAY HELLO WORLD.
      **************************************

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
JULIOB      DISPLAY 'Hello, world!'.
            STOP RUN.
