       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBCPF.
      ***************************************************
      * AREA DE COMENTÁRIOS
      * AUTOR: JULIO BITTENCOURT
      * OBJETIVO: UTILIZAR MASCARA PARA IMPRIMIR CPF FORMATADO
      * POSSIBILIDADE 1: CRIAÇÃO DE VARIÁVEL MÁSCARA SIMPLES
      * EXIGE CONF DO AMBIENTE (DECIMAL-POINT IS COMMA).
      * MAS SÓ ACEITA ZEROS À ESQUERDA SE FOR COM 9s, NÃO COM Zs.
      * DATA: 24/10/2021
      ***************************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
         DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WRK-CPF PIC 9(11).

       01 WRK-CPF-ED PIC 999.999.999/99.

       PROCEDURE DIVISION.
         DISPLAY 'CPF: '
         ACCEPT WRK-CPF FROM CONSOLE.
         MOVE WRK-CPF TO WRK-CPF-ED.
         DISPLAY WRK-CPF-ED.
