          IDENTIFICATION DIVISION.
          PROGRAM-ID. HelloWorld.
          
          PROCEDURE DIVISION.
           DISPLAY 'HELLO, WORLD!'.
           STOP RUN.

